###############################################################################
# Created by write_sdc
###############################################################################
current_design mult
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 8.3330 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[0]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[1]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[2]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[3]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[4]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[5]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[6]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {a[7]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[0]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[1]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[2]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[3]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[4]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[5]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[6]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {b[7]}]
set_input_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {rst}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[0]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[10]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[11]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[12]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[13]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[14]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[15]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[1]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[2]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[3]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[4]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[5]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[6]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[7]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[8]}]
set_output_delay 1.6666 -clock [get_clocks {clk}] -add_delay [get_ports {product[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {product[15]}]
set_load -pin_load 0.0334 [get_ports {product[14]}]
set_load -pin_load 0.0334 [get_ports {product[13]}]
set_load -pin_load 0.0334 [get_ports {product[12]}]
set_load -pin_load 0.0334 [get_ports {product[11]}]
set_load -pin_load 0.0334 [get_ports {product[10]}]
set_load -pin_load 0.0334 [get_ports {product[9]}]
set_load -pin_load 0.0334 [get_ports {product[8]}]
set_load -pin_load 0.0334 [get_ports {product[7]}]
set_load -pin_load 0.0334 [get_ports {product[6]}]
set_load -pin_load 0.0334 [get_ports {product[5]}]
set_load -pin_load 0.0334 [get_ports {product[4]}]
set_load -pin_load 0.0334 [get_ports {product[3]}]
set_load -pin_load 0.0334 [get_ports {product[2]}]
set_load -pin_load 0.0334 [get_ports {product[1]}]
set_load -pin_load 0.0334 [get_ports {product[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {a[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {b[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
