###############################################################################
# Created by write_sdc
###############################################################################
current_design mult
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 25.0000 [get_ports {clk}]
set_clock_uncertainty -setup 0.2500 clk
set_clock_uncertainty -hold 0.1250 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[0]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[0]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[1]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[1]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[2]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[2]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[3]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[3]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[4]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[4]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[5]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[5]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[6]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[6]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a[7]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a[7]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[0]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[0]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[1]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[1]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[2]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[2]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[3]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[3]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[4]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[4]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[5]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[5]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[6]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[6]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {b[7]}]
set_input_delay 12.5000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {b[7]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[0]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[0]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[10]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[10]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[11]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[11]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[12]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[12]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[13]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[13]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[14]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[14]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[15]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[15]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[1]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[1]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[2]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[2]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[3]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[3]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[4]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[4]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[5]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[5]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[6]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[6]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[7]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[7]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[8]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[8]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {product[9]}]
set_output_delay 18.7500 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {product[9]}]
###############################################################################
# Environment
###############################################################################
set_input_transition 0.2500 [get_ports {clk}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
